package homeWork;

public class Homework03 {
	
	/*
	 * 1. 클래스의 3요소를 활용하여 Homework03클래스를 완성해주세요.
	 * 
	 * *** 변수명, 함수명은 본인이 자유롭게 작성해주세요.
	 */ 
	
	// # 필드를 작성해주세요
	// 1. 이름을 저장할 변수를 만들어주세요.
	
	String name;
	
	// 2. 나이를 저장할 변수를 만들어주세요.
	
	int age;
	
	// 3. 성별을 저장할 변수를 만들어주세요.
	
	String gender;
	
	// 4. 주소를 저장할 변수를 만들어주세요.
	
	String addr;

	// 5. 핸드폰번호를 저장할 변수를 만들어주세요.
	
	String tel;
	
	// 6. 이메일을 저장할 변수를 만들어주세요.
	
	String email;
	
	// 7. 취미를 저장할 변수를 만들어주세요.
	
	String hobby;
	
	// # 생성자를 작성해주세요
	// 8. 기본생성자를 만들어주세요.
	
	
	
	// 9. 이름을 입력받을 수 있는 커스텀 생성자를 만들어주세요.
	// 그리고 입력받아온 이름을 초기화해주세요.
	
	// 10. 이름, 나이를 입력받을 수 있는 커스텀 생성자를 만들어주세요.
	// 그리고 입력받아온 이름, 나이를 초기화해주세요.
	
	// 11. 이름, 나이, 성별을 입력받을 수 있는 커스텀 생성자를 만들어주세요. 
	// 그리고 입력받아온 이름, 나이, 성별을 초기화해주세요.
	
	
	// # 함수를 작성해주세요.
	// 12. 이름을 출력할 수 있는 함수를 만들어주세요.
	
	// 13. 나이를 출력할 수 있는 함수를 만들어주세요.
	
	// 14. 성별을 출력할 수 있는 함수를 만들어주세요.
	
	// 15. 주소를 출력할 수 있는 함수를 만들어주세요.
	
	// 16. 핸드폰번호를 출력할 수 있는 함수를 만들어주세요.
	
	// 17. 이메일을 출력할 수 있는 함수를 만들어주세요.
	
	// 18. 취미를 출력할 수 있는 함수를 만들어주세요.
	
	// 19. 이름, 나이, 성별을 출력할 수 있는 함수를 만들어주세요.
	
	// 20. 주소, 핸드폰번호, 이메일, 취미를 출력할 수 있는 함수를 만들어주세요.
	
	// 21. 이름, 나이, 성별, 주소, 핸드폰번호, 이메일, 취미를 출력할 수 있는 함수를 만들어주세요.
	
	// 22. 주소를 전달받아서 전달받은 주소를 저장할 수 있는 함수를 만들어주세요.
	
	// 23. 핸드폰번호를 전달받아서 전달받은 핸드폰번호를 저장할 수 있는 함수를 만들어주세요.
	
	// 24. 이메일을 전달받아서 전달받은 이메일을 저장할 수 있는 함수를 만들어주세요.
	
	// 25. 취미를 전달받아서 전달받은 취미를 저장할 수 있는 함수를 만들어주세요.
	
	// 26. 주소, 핸드폰번호를 전달받아서 전달받은 주소, 핸드폰번호를 저장할 수 있는 함수를 만들어주세요.
	
	// 27. 이메일, 취미를 전달받아서 전달받은 이메일, 취미를 저장할 수 있는 함수를 만들어주세요.
	
	public static void main(String[] args) {
		// 26. Homework03 클래스 객체를 인스턴스화 과정을 통해 인스턴스를 만들어주세요. (객체 생성)
		// 이때, 기본 생성자를 이용해서 만들어주세요.
		
		// 27. 만들어진 Homework03 클래스 객체 변수를 이용해서 주소, 핸드폰번호, 이메일, 취미를 저장할 수 있는 함수를 이용해 값을 저장해주세요.
		
		// 28. 26번에서 만들어진 클래스 객체 변수를 이용해서 27번에서 넣었던 주소 값을 함수를 이용해서 출력해주세요.
		
		// 29. 26번에서 만들어진 클래스 객체 변수를 이용해서 27번에서 넣었던 핸드폰번호 값을 함수를 이용해서 출력해주세요.
		
		// 30. 26번에서 만들어진 클래스 객체 변수를 이용해서 27번에서 넣었던 이메일 값을 함수를 이용해서 출력해주세요.
		
		// 31. 26번에서 만들어진 클래스 객체 변수를 이용해서 27번에서 넣었던 취미 값을 함수를 이용해서 출력해주세요.
		
		// 32. Homework03 클래스 객체를 인스턴스화 과정을 통해 인스턴스를 만들어주세요. (객체 생성)
		// 이때, 이름,나이를 입력받아 만들 수 있는 생성자를 이용하여 객체를 만들어주세요.
		
		// 33. 만들어진  Homework03 클래스 객체 변수를 이용해서 성별을 저장할 수 있는 함수를 이용해 값을 저장해주세요.
		
		// 34. 32번에서 만들어진 클래스 객체 변수를 이용해서 이름, 나이, 성별 값을 함수를 이용해서 출력해주세요.
		
		// 35. Homework03 클래스 객체를 인스턴스화 과정을 통해 인스턴스를 만들어주세요. (객체 생성)
		// 이때, 이름, 나이, 성별을 입력받아 만들 수 있는 생성자를 이용하여 객체를 만들어주세요.
		
		// 36. 만들어진 Homework03 클래스 객체 변수를 이용해서 이름, 나이, 성별 값을 함수를 이용해서 출력해주세요.
		
		// 37. 35번에서 만들어진 클래스 객체 변수를 이용해서 이름을 홍길동으로 변경해주세요. (이름에 새로운 이름으로 저장)
		
		// 38. 35번에서 만들어진 클래스 객체 변수를 이용해서 나이를 99로 변경해주세요. (나이에 새로운 나이로 저장)
		
		// 39. 35번에서 만들어진 클래스 객체 변수를 이용해서 성별을 반대 성별로 변경해주세요. (성별에 새로운 성별으로 저장)
		
		// 40. 새롭게 변경된 이름, 나이, 성별을 함수를 이용해서 출력해주세요.
		
	}
}
